Repository: temaxuck/Encyclopedia
Catalog: encyclopedia/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Default: by pyramid's sequence number, generating function, explicit formula, by user's username; By data: by pyramid's data table (which you can see on pyramid's page specifically).
ru: Стандартный: аттрибуты пирамиды порядковый номер, производящая функция, явная формула, аттрибуты пользователя имя пользователя; По таблице данных: аттрибуты пирамиды таблица данных (находится на странице пирамиды).

source: Search...
ru: Поиск...

source: Search for pyramids
ru: Поиск пирамид

source: On this site you can
ru: На нашем сайте вы можете

source: Browse through pyramid list
ru: Просмотреть пирамиды

source: Go to pyramid list
ru: Перейти к пирамидам

source: Find out what this encyclopedia is for
ru: Узнать, для чего нужна данная энциклопедия

source: Go to encyclopedia application
ru: Перейти к методике использования

source: Learn more about the project team
ru: Узнать подробнее о создателях

source: Go to project info
ru: Посмотреть информацию

source: Error
ru: Ошибка

source: Don't have an account?
ru: Нет учётной записи?

source: Your search
ru: Ваш поисковый запрос

source: did not match anything
ru: не соотвествует ни одной записи

source: Try going back
ru: Попробуйте вернуться на

source: home
ru: главную страницу

source: and perform another search
ru: и выполнить новый поисковый запрос

source: Sorry, there's no such page. You can try going
ru: К сожалению, такой страницы не существует. Вы можете попробовать вернуться на

source: and explore pyramids.
ru: и исследовать пирамиды.

source: Edit pyramid
ru: Редактировать пирамиду

source: Pyramid
ru: Пирамида

source: Generating function
ru: Производящая функция

source: Explicit formula
ru: Явная формула

source: Data table
ru: Таблица данных

source: Related
ru: Связанные пирамиды

source: Export
ru: Экспорт

source: Export as Maxima
ru: Экспортировать в Maxima

source: Export as LaTeX
ru: Экспортировать в LaTeX

source: Copy
ru: Скопировать

source: Confirm deletion
ru: Подтвердите удаление

source: Are you sure, you want to delete Pyramid
ru: Вы уверены, что хотит удалить Пирамиду

source: Cancel
ru: Отменить

source: This pyramid is not valid. It'll be fixed as soon as posible
ru: Данная пирамида некорректна. Она будет исправлена в скором времени

source: Preview
ru: Предпросмотр

source: Author
ru: Автор

source: Page
ru: Страница

source: or
ru: или

source: search results
ru: Результаты по поиску

source: Already have an account
ru: Уже есть учётная запись?

source: Edit your profile
ru: Редактировать профиль

source: Uploaded file
ru: Загруженный файл
