Repository: temaxuck/Encyclopedia
Catalog: encyclopedia/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Username or Email
ru: Имя пользователя или Электронная почта

source: Password
ru: Пароль

source: Remember me
ru: Запомнить меня

source: Log in
ru: Войти

source: Username
ru: Имя пользователя

source: E-mail
ru: Электронная почта

source: Confirm password
ru: Введите пароль ещё раз

source: Doesn't match password
ru: Пароли не совпадают

source: Sign up
ru: Зарегистрироваться

source: User with such username already exists.
ru: Пользователь с таким именем уже существует.

source: User with such email already exists.
ru: Пользователь с таким адресом электронной почты уже существует.

source: Invalid Email
ru: Неверно введён адрес электронной почты

source: Update profile picture
ru: Загрузить изображение профиля

source: Save profile
ru: Сохранить изменения

source: Function name
ru: Имя функции

source: Function variables
ru: Переменные функции

source: Expression
ru: Выражение

source: Condition
ru: Условие

source: Delete pyramid
ru: Удалить пирамиду

source: Default
ru: Стандартный

source: By data
ru: По таблице данных

source: Search
ru: Поиск

source: Search type
ru: Тип поиска

source: Project team
ru: В разработке данного сайта и его содержимого принимают участие

source: "Laboratoriya algoritmov i tekhnologij issledovaniya diskretnyh struktur" stuff
ru: Сотрудники Лаборатории алгоритмов и технологий исследования дискретных структур

source: TUSUR students - group project training participants
ru: Студенты ТУСУР - участники Группового проектного обучения

source: "Laboratoriya algoritmov i tekhnologij issledovaniya diskretnyh struktur" (LATIDS) of the Faculty of "KSUP"
ru: Лаборатория алгоритмов и технологий исследования дискретных структур (ЛАТИДС) кафедры КСУП

source: Leading Researcher
ru: Ведущий научный сотрудник

source: Kruchinin Dmitry Vladimirovich
ru: Кручинин Дмитрий Владимирович

source: Candidate of Physical and Mathematical Sciences
ru: Кандидат физико-математических наук

source: Head of the Laboratory
ru: Заведующий лабораторией

source: LATIDS stuff
ru: Сотрудники ЛАТИДС

source: Kruchinin Vladimir Viktorovich
ru: Кручинин Владимир Викторович

source: Doctor of Technical Sciences, Associate Professor
ru: Доктор технических наук, доцент

source: Perminova Maria Yurievna
ru: Перминова Мария Юрьевна

source: Candidate of Technical Sciences, Senior Researcher
ru: Кандидат технических наук, старший научный сотрудник

source: Shablya Yuri Vasilyevich
ru: Шабля Юрий Васильевич

source: Group Project Training participants
ru: Группа ГПО

source: Alina Polina Sergeevna
ru: Алина Полина Сергеевна

source: Darizhapov Artem Batoevich
ru: Дарижапов Артём Батоевич

source: Kontsevaya Kristina Anatolyevna
ru: Концевая Кристина Анатольевна

source: Korneeva Yulia Andreevna
ru: Корнеева Юлия Андреевна

source: Edit profile
ru: Редактировать профиль

source: Upload pyramid
ru: Загрузить пирамиду

source: Log out
ru: Выйти

source: Home
ru: Главная

source: Pyramid list
ru: Список пирамид

source: Application
ru: Методика использования

source: About
ru: О проекте

source: Interface language
ru: Язык интерфейса

source: Tomsk State University of Control Systems and Radioelectronics
ru: Томский Государственный Университет Систем Управления и Радиоэлектроники
